<%@ Page Language="C#" AutoEventWireup="true" CodeBehind="SecondStep.aspx.cs" Inherits="TravelOnline.NewPage.order.SecondStep" %>
<%@ Register src="/NewPage/MemberFooter.ascx" tagname="Footer" tagprefix="uc2" %>
<!DOCTYPE HTML>
<html>
<head>
	<title>上海青旅官网:旅游网_自由行_旅游签证_国内游_出国游_旅游线路推荐上海青旅官网</title>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge, chrome=1">
    <meta name="description" content="上海青旅官网(www.scyts.com)-上海市首批5A级旅行社,全国旅游标准化试点旅行社,全国百强旅行社,提供包含国内旅游.出境旅游.自由行.邮轮旅游及旅游签证等服务" />
    <meta name="keywords" content="上海市首批5A级旅行社,上海旅行社,旅游,度假,出境旅游,国内旅游,上海青旅,上海中国青年旅行社" />
    <link rel="shortcut icon" href="">
    <link href="/newcss/common.css" rel="stylesheet" type="text/css" />
    <link href="/newcss/temphefot.css" rel="stylesheet" type="text/css" />
    <link href="/newcss/index.css" rel="stylesheet" type="text/css" />
    <link href="/newcss/order.css" rel="stylesheet" type="text/css" />
    <link href="/newcss/line.css" rel="stylesheet" type="text/css" />
    <link href="/newcss/oldline.css" rel="stylesheet" type="text/css" />
    <link href="/newcss/page.css" rel="stylesheet" type="text/css" />
</head>
<body>
	<!--页头Begin-->
	<div class="order-header">
		<div class="narrow">
            <div class="header-top-order">
                <a class="logo-s" title="上海中国青年旅行社" href="http://www.scyts.com/"></a>
                <div class="sidebar rl">
                    <ul class="clearfix">
                        <%=LoginInfo%>
                        <li class="">|</li>
                        <li><a href="javascript:;">帮助中心</a></li>
                    </ul>
                </div>
            </div>
        </div>
	</div>
	<!--正文内容Begin-->
	<div class="wrap clearfix">
    	<div class="line-b"></div>
        <div class="orderbox">
            <ul>
                <li class="cur"><i class="ci gc"><b></b></i><p class="gp">选择线路</p></li>
                <li class="cur"><i class="ci gc">2</i><p class="gp">填写信息</p></li>
                <li><i class="ci">3</i><p>预定成功</p></li>
                <li><i class="ci">4</i><p>在线支付</p></li>
                <li><i class="ci">5</i><p>支付成功</p></li>
            </ul>
        </div>
		<div class="main-content-book fl">
        	<!--头部展开详情-->
			<div class="titbox">
                <div class="click-bnt">展开详情<i></i></div>
                <div class="shrink">
                	<h2><a href="/line.html?id=<%=lineid %>" target="_blank"><%=linename %></a></h2>
                    <div class="line"></div>
                    <dl>
                    	<dd>出发日期:<span class="fb"><%=bgndate %></span></dd>
                        <dd><%=LineDayString %></dd>
                    </dl>
                    <dl>
                    	<dd>预定人数:<span>成人 <%=Adults %></span>&nbsp;&nbsp;<span>儿童 <%=Childs%></span></dd>
                    </dl>
                </div>
            </div>
            <!--表单-->
            <form id="submit_form" class="registerform" onsubmit="return false;" action="javascript:;">
            <input id="OrderId" name="OrderId" type="hidden" value="<%=OrderId %>"/>
            <input id="price" name="price" type="hidden" value="<%=Price%>" />
            <input id="couponAmount" name="couponAmount" type="hidden" value="0" />
            <input id="IntegralAmount" name="IntegralAmount" type="hidden" value="0" />
            <input id="ProductType" name="ProductType" type="hidden" value="<%=ProductType%>" />
                
            <div class="infobox clearfix">
            	<h2>联系人信息</h2>
                <ul class="rl">
                	<li>
                    	<label class="info-label" for=""><span>*</span>姓名</label>
                        <input class="input-w text_default" type="text" placeholder="请填写真实姓名" value="<%=ordername %>" id="ordername" name="ordername" class="inputxt" datatype="z2-5" nullmsg="请填写联系人姓名" errormsg="联系人姓名不可少于2个汉字" />
                    </li>
                    <li>
                    	<label class="info-label" for=""><span>*</span>手机号码</label>
                        <input class="input-w text_default" id="ordermobile" name="ordermobile" type="text" placeholder="用于接收确认信息" value="<%=ordermobile %>" maxlength="11" datatype="m" nullmsg="请填写手机号码" errormsg="请填写有效的11位手机号码" />
                    </li>
                    <li>
                    	<label class="info-label" for=""><span>*</span>电子邮件</label>
                        <input class="input-w text_default" id="orderemail" name="orderemail" type="text" placeholder="用于接收确认信息" value="<%=orderemail %>" maxlength="50" datatype="e" nullmsg="请填写电子邮件地址" errormsg="请正确填写电子邮件地址" />
                    </li>
                    <li>
                    	<label class="info-label" for="">给商家留言<br/>最多100字</label>
                        <textarea class="text_default" name="ordermemo" id="ordermemo" name="" maxlength="100"></textarea>
                    </li>
                </ul>
                <div class="line"></div>
                <h2>游客信息</h2>
                <%=Guestinfo %>
                <div class="line"></div>
                <h2>发票信息</h2>
                	<ul class="rl">
                        <li>
                            <label class="info-label" for=""><span>*</span>是否需要发票</label>
                            <label class="radio fq-f">
                                <input name="fptf" type="radio" value="否" checked="checked"/>否
                            </label>
                            <label class="radio fq-s">
                                <input name="fptf" type="radio" value="是"/>是
                            </label>
                        </li>
                        <div class="fp-box hide">
                            <li>
                                <label class="info-label" for="">发票抬头</label>
                                <input id="InvoiceName" name="InvoiceName" class="input-w text_default" type="text" datatype="*" ignore="ignore" placeholder="公司或个人" value="公司或个人" nullmsg="请填写发票抬头" errormsg="请填写发票抬头" maxlength="50" />
                            </li>
                            <li>
                                <label class="info-label" for="">发票明细</label>
                                <select name="choose" id="choose">
                                    <option value="旅游费"  selected="selected">旅游费</option>
                                </select>
                            </li>
                            <li><div class="fpline"></div></li>
                            <li>
                                <label class="info-label" for=""><span>*</span>收件人</label>
                                <input name="In_GuestName" class="input-w text_default" type="text" datatype="*" placeholder="请填写收件人" value="请填写收件人" nullmsg="请填写收件人" errormsg="请填写收件人"  maxlength="50" />
                            </li>
                            <li>
                                <label class="info-label" for=""><span>*</span>手机号码</label>
                                <input name="In_GuestMobile" class="input-w text_default" type="text" datatype="m" placeholder="请填写收件人手机号码" value="请填写收件人手机号码" nullmsg="请填写收件人手机号码" errormsg="请填写有效的11位手机号码"  maxlength="11"/>
                            </li>
                            <li>
                                <label class="info-label" for="">配送方式</label>
                                <label class="radio kd">
                                    <input name="express" type="radio" placeholder="快递配送（运费到付）" value="快递配送（运费到付）" checked="checked" />快递配送（运费到付）
                                </label>
                                <label class="radio zd">
                                    <input name="express" type="radio" placeholder="指定地点自取" value="指定地点自取"/>指定地点自取
                                </label>
                            </li>
                            <div class="exp1">
                                <li>
                                    <label class="info-label" for=""><span>*</span>收件地址</label>
                                    <input name="In_GuestAddress" class="input-w text_default" type="text" datatype="*" placeholder="请填写收件地址" value="请填写收件地址" nullmsg="请填写收件地址" errormsg="请填写收件地址"  maxlength="100"/>
                                </li>
                            </div>
                            <div class="exp2 hide">
                                <li>
                                    <label class="info-label" for=""><span>*</span>领取地址</label>
                                    <div class="zddd">上海市徐汇区衡山路2号201室，09:30-17:30,4006-777-666</div>
                                </li>
                            </div>
                        </div>
                    </ul>
                    <div class="line"></div>
                <h2>优惠信息</h2>
                <ul class="rl cou-box">
                    <li>
                        <label class="radio" id="remove">
                            <input name="coupon" type="radio" value="不使用" checked="checked" />不使用优惠券
                        </label>
                    </li>
                    <li>
                        <label class="radio" id="getGreen">
                            <input name="coupon" type="radio" value="使用" />使用优惠券
                        </label>
                    </li>
                    <li>
                        <input class="text_default Validform_error input-z" type="text" id="couponNum" name="couponNum" ignore="ignore" 
                            placeholder="查看可用优惠券，复制券密码至此" datatype="n-e" nullmsg="请正确填写优惠券编号" />
                        <a class="cou-use" href="javascript:void(0)" onclick="Coupon()" style="margin-right:5px;">使用</a>&nbsp;
                        <a class="cou-use" href="javascript:void(0)" onclick="ValidCoupon()">可用优惠券</a>
                    </li>
                </ul>
                    <div class="line"></div>
                <h2>积分信息</h2>
                <ul class="rl integral-box">
                    <li>
                        <label class="radio" id="removeIntegral">
                            <input name="Integral" type="radio" value="不使用" checked="checked" />不使用积分
                        </label>
                    </li>
                    <li>
                        <label class="radio" id="getGreenIntegral">
                            <input name="Integral" type="radio" value="使用" />使用积分
                        </label>
                    </li>
                    <li>
                        <input class="text_default Validform_error input-z" type="text" id="IntegralNum" name="IntegralNum" ignore="ignore" 
                            placeholder="输入积分(积分兑换比例为<%=ratio%>：1元)" datatype="n-e" nullmsg="请输入需要使用的积分" />
                        <a class="integral-use" href="javascript:void(0)" onclick="Integral()" style="margin-right:5px;">使用</a>&nbsp;
                        <a class="integral-use" href="javascript:void(0)">可用积分:<%=Integral%></a>
                    </li>
                </ul>     
            </div>
            <!--表单	end	-->

            <!--预订须知-->
            <div class="contbox">
                <h2>预定须知</h2>
                <div class="cont">
                    <h3>注意事项</h3>
                    <dl>
                      <%=Attentions %>
                    </dl>
                    <!--出境旅游合同-->
                    <div class="word outbound <%=hide_outbound %>">
                        <h1>上海市出境旅游合同示范文本</h1>
                        <h1>（2013版）</h1>
                        <h2>使用说明</h2>
                        <p>一、根据《中华人民共和国合同法》、《中华人民共和国旅游法》、《旅行社条例》制订本合同，供旅游者参加出境旅游（不含赴台湾地区旅游）与旅行社签订团队出境旅游合同时使用。旅游者应选择具有合法经营出境旅游业务资格的旅行社。旅行社应具有旅游行政管理部门颁发的《旅行社业务经营许可证》和工商行政管理部门颁发的《营业执照》。</p>
                        <p>二、旅游前，旅行社应当与旅游者签订书面旅游合同，向旅游者提供与本合同团号一致的旅游行程单，经双方签字或者盖章确认后作为本合同的组成部分。旅游者在交纳费用后，旅行社应开具发票。</p>
                        <p>三、旅游者应结合自身身体状况选择旅游产品及项目。</p>
                        <p>四、旅行社委托组团、拼团的，须事先告知旅游者并在本合同中载明。拼团，指出境社在保证所承诺的服务内容和标准不变的前提下，在签订合同时经旅游者同意，与其他出境社招徕的旅游者拼成一个团统一安排旅游服务的行为。</p>
                        <p>五、旅游者与旅行社通过互联网在线旅游网站签订合同的可使用本合同电子版。</p>
                        <p>六、在填写本合同第二条“行程与标准”和“旅游行程单”时，旅行社应以准确、明晰的语言表述，不得出现“准X星级”、“相当于X星级”“豪华”、“仅供参考”、“与××同级”等模糊不确定性用语。</p>
                        <p>七、旅行社在签订合同时应注明该旅游项目所包含的景点门票及住宿、餐饮、交通标准、导游服务等相关内容。</p>
                        <p>八、旅行社制定补充条款对本合同示范文本有关条款的内容进行补充、细化的，补充条款的内容不得减轻或者免除应当由旅行社承担的责任。</p>
                        <p>九、本合同文本是《上海市出境旅游合同示范文本(2004版)》修改版本。</p>
                        <p>十、旅游咨询与投诉机构：</p>
                        <p>1、上海市旅游质量监督所地址：中山西路2525号    邮编：200030</p>
                        <p>投诉电话：64393615、962020</p>
                        <p>2、上海市消费者申（投）诉举报中心</p>
                        <p>举报投诉电话：12315</p>
                        <p>3、上海市文化市场行政执法总队地址：永嘉路383号    邮编：200040</p>
                        <p>旅游违法违规举报电话：12318</p>
                        <p>合同编号：<u>《合同编号》</u></p>
                        <h2>上海市出境旅游合同</h2>
                        <h2>（2013版）</h2>
                        <p>甲方（旅游者或旅游团体）：<u>《游客姓名》</u></p>
                        <p>乙方（旅行社）：上海中国青年旅行社_经营许可证编号：<u>L-SH-CJ00004</u></p>
                        <p>经营范围：入境旅游业务，国内旅游业务，特许经营中国公民自费出国</p>
                        <p>旅游业务。国内国际航空运输销售代理、会展服务。_______________________</p>
                        <p></p>
                        <p>根据《中华人民共和国旅游法》、《中华人民共和国合同法》、《旅行社条例》及其它有关法律法规的规定，双方在平等自愿、协商一致的基础上，签订本合同。</p>
                        <h3>第一条  合同标的</h3>
                        <p>旅游产品名称《线路名称》。</p>
                        <p>团号《团号》，人数_《订单人数》_。</p>
                        <p>组团方式</p>
                        <p>□自行组团</p>
                        <p>□委托组团（委托社全称___________________________）。</p>
                        <p>□拼  团（其他社全称___________________________）。</p>
                        <p>出发日期《出发日期》，出发地点_________________________。</p>
                        <p>途径地点（经停地点）______________________________________。</p>
                        <p>目的地____________________________________________________。</p>
                        <p>结束日期《返回日期》，返回地点__________________________。</p>
                        <h3>第二条  行程与标准（提供旅游行程单，须含下列要素）</h3>
                        <p>景点名称和游览时间<u>详见行程</u></p>
                        <p>__________________________________________________________。</p>
                        <p>往返交通<u>详见行程</u>，标准<u>详见行程</u>。</p>
                        <p>游览交通<u>详见行程</u>，标准<u>详见行程</u>。</p>
                        <p>旅游者自由活动时间<u>详见行程</u>，次数<u>详见行程</u>。</p>
                        <p>住宿安排（名称）及标准和住宿天数<u>详见行程</u>。</p>
                        <p>用餐次数<u>详见行程</u>，标准<u>详见行程</u>。</p>
                        <p>地接社名称<u>详见行程</u>，地址<u>详见行程</u>，</p>
                        <p>地接社联系人<u>详见行程</u>，联系电话<u>详见行程</u>。</p>
                        <h3>第三条  旅游者保险</h3>
                        <p>乙方提示甲方购买旅游意外险。经乙方推荐，甲方_________（应填同意或不同意，打勾无效）委托乙方办理个人投保的旅游意外保险。</p>
                        <p>保险公司及产品名称：______________________________________。</p>
                        <p>保险金额：___________元，保险费__________元。</p>
                        <h3>第四条  旅游费用及其支付</h3>
                        <p>甲方应交纳旅游费用总额《费用合计》元，大写________元。（含领队、导游服务费用________元/人，合计__________元）。</p>
                        <p>旅游费用交纳期限__________________________________________。</p>
                        <p>旅游费用交纳方式_□现金；□支票；□信用卡；□其他_________。</p>
                        <h3>第五条  双方的权利义务</h3>
                        <p>（一）甲方的权利与义务</p>
                        <p>1.甲方有权自主选择旅游产品和服务，有权拒绝乙方的强制交易行为，有权知悉其购买的旅游产品和服务的真实情况，有权要求乙方按照本合同和旅游行程单的约定提供产品和服务，拒绝乙方及其工作人员未经协商一致指定具体购物场所，安排另行付费旅游项目的行为。</p>
                        <p>2.甲方有权拒绝乙方未经事先协商一致的转团、拼团行为。</p>
                        <p>3.甲方在人身、财产安全遇有危险时，有请求救助和保护的权利。甲方人身、财产受到侵害的，有依法获得赔偿的权利。</p>
                        <p>4.甲方应自觉遵守旅游文明行为规范。遵守社会公共秩序和社会公德，尊重旅游目的地的风俗习惯、文化传统和宗教禁忌，爱护旅游资源，保护生态环境；遵守我国和旅游目的地的相关法律、法规，不得参与违法活动。甲方应参加行前说明会，遵守团队纪律，配合乙方完成合同约定的旅游行程。</p>
                        <p>5.甲方在旅游过程中，应自行妥善保管好自己的物品。</p>
                        <p>6.在自行安排活动期间，甲方应在自己能够控制风险的范围内活动，选择自己能够控制风险的活动项目，并对自己的安全负责。</p>
                        <p>7.行程中发生纠纷，甲方应与乙方平等协商解决。甲方在旅游活动中或者在解决纠纷时，不得损害当地居民的合法权益，不得干扰他人的旅游活动，不得损害乙方的合法权益，不得以拒绝上、下机（车、船、邮轮）等方式解决纠纷，应当采取积极措施防止损失扩大，否则应当就扩大的损失承担赔偿责任。</p>
                        <p>8.甲方实际出行人或代理人在签订合同或者填写各种报名、签证所需材料时，应当使用有效身份证件，应当提供所有实际出行人的姓名、性别、身份证号等相关信息，并对委托代理的有效性及填写信息的真实性负责。限制行为能力的未成年人等出行的，须由监护人陪同出行。_</p>
                        <p>9.甲方购买旅游产品、接受旅游服务时，应当如实告知与旅游活动相关的个人健康信息，参加适合自身条件的旅游活动，遵守旅游活动中的安全警示要求，配合有关部门、机构或乙方采取的安全防范和应急处理措施。</p>
                        <p>10.甲方向乙方提交的出入境证件应当符合相关规定。甲方不得在境外非法滞留，不得擅自分团、脱团。</p>
                        <p>11.甲方不能成行的，可以让具备参加本次旅游条件的第三人代为履行合同，并及时通知乙方，没有正当理由的乙方不得拒绝。因此增加的费用，由甲方承担；减少的费用退还甲方。</p>
                        <p>（二）乙方的权利与义务</p>
                        <p>1.乙方不得以不合理的低价组织旅游活动，诱骗旅游者，并通过安排购物或者另行付费旅游项目获取回扣等不正当利益。</p>
                        <p>2.乙方应在出团前，以说明会等形式如实告知相关旅游服务项目和标准，及应当注意的旅游目的地相关法律法规、风俗习惯、宗教禁忌等，并要求甲方签字确认。</p>
                        <p>3.乙方在合同订立时及履行中，应如实告知甲方不适合参加旅游行程的情形，对可能危及甲方人身、财产安全的注意事项，须向甲方做出真实的说明和明确的警示（可另附安全告知书，并要求甲方签字确认）。甲方人身、财产权益受到损害时，乙方应当采取合理必要的保护和救助措施。_</p>
                        <p>4.乙方应妥善保管甲方提交的各种材料信息，依法对甲方信息保密。</p>
                        <p>5.因航空、轮船、铁路运输等费用遇政策性调价导致合同总价发生变更的，双方应按实际差额结算，多退少补。</p>
                        <p>6.因不可抗力或者乙方、其他履行辅助人已尽合理注意义务仍不能避免的事件，影响旅游行程的，按照下列情形处理：</p>
                        <p>（1）合同不能继续履行的，可以解除合同。合同不能完全履行的，乙方经向甲方作出说明，可以在合理范围内变更合同；甲方不同意变更的，可以解除合同。</p>
                        <p>（2）合同解除的，乙方在扣除已向地接社或者履行辅助人支付且不可退还的费用后（包括但不仅限于机票、火车票、船票等交通费用、护照成本手续费、实际签证及签注费和其他不可撤销的预定费用），将余款退还甲方；因合同变更而增加的费用由甲方承担，减少的费用退还甲方。</p>
                        <p>（3）危及旅游者人身、财产安全的，乙方应当采取相应的安全措施，因此支出的费用，由甲方承担。</p>
                        <p>（4）造成甲方滞留的，乙方应当采取相应的安置措施。因此增加的食宿费用，由甲方自行承担；增加的返程费用，由甲乙双方平均分担。</p>
                        <p>7.因不可抗力等不可归责于乙方的客观原因或者乙方已尽合理注意义务仍不能避免的事件包括并不限于：恶劣天气、自然灾害、战争、罢工、骚乱、恐怖事件、政府行为、公共卫生事件、公共交通工具延误或（和）取消团队位置或（和）更改班次、危及旅游者人身和财产安全的意外情形等客观原因，造成旅游行程安排的交通服务延误或取消、景区临时关闭、宾馆饭店临时被征用、我国政府机构发布旅游预警信息等，因上述事由导致旅游目的无法实现，乙方不承担违约责任，但乙方应当将未发生的旅游费用退还甲方。</p>
                        <p> 8.乙方为甲方安排符合法律法规规定的领队人员。</p>
                        <p> 9.甲方有下列情形之一的，乙方可以解除合同：</p>
                        <p>（1）患有传染病等疾病，可能危害其他旅游者健康和安全的；</p>
                        <p>（2）携带危害公共安全的物品且不同意交有关部门处理的；</p>
                        <p>（3）从事违法或者违反社会公德的活动的；</p>
                        <p>（4）从事严重影响其他旅游者权益的活动，且不听劝阻、不能制止的；</p>
                        <p>（5）法律规定的其他情形。</p>
                        <p>因前款情形解除合同的，乙方应当在扣除必要的费用后，将余款退还甲方；给乙方造成损失的，甲方应当依法承担赔偿责任。</p>
                        <p>10.成团人数与不成团的约定（二选一）</p>
                        <p>□最低成团人数______人；低于此人数不能成团时，乙方应当提前30日（按照出发日减去解除合同通知到达日的自然日之差计算，下同）通知甲方，本合同解除，向甲方退还已收取的全部费用。</p>
                        <p>□本团成团不受最低人数限制。</p>
                        <h3>第六条  甲方解除合同及承担必要费用</h3>
                        <p>因甲方自身原因导致合同解除，乙方扣除必要的费用后，将余款退还甲方。</p>
                        <p>（一）在行程前解除合同的，必要的费用扣除标准为：</p>
                        <p>1.行程前30日至15日，旅游费用5%；</p>
                        <p>2.行程前14日至7日，旅游费用10%；</p>
                        <p>3.行程前6日至4日，旅游费用70%；</p>
                        <p>4.行程前3日至1日，旅游费用85%；</p>
                        <p>5.行程开始当日，旅游费用90%。</p>
                        <p>甲方行程前逾期支付旅游费用超过<span style="color:red; font-weight:bold;">2</span>日的，或者甲方未按约定时间到达约定集合出发地点，也未能在中途加入旅游团队的，乙方可以视为甲方解除合同，乙方可以按本款规定扣除必要的费用后，将余款退还甲方。</p>
                        <p>（二）在行程中解除合同的，必要的费用扣除标准为：</p>
                        <p>（旅游费用-旅游费用*行程开始当日扣除比例)/旅游天数×已经出游的天数+旅游费用*行程开始当日扣除比例。</p>
                        <p>如按上述方式支付的必要费用低于实际发生的费用，按照实际发生的费用扣除，但最高额不应当超过旅游费用总额。乙方实际发生的费用为护照（通行证）成本手续费、实际签证（签注）费、国际国内交通票损失费和已向地接社或者履行辅助人支付且不可退还的费用。</p>
                        <p>行程前解除合同的，乙方扣除必要费用后，应当在合同解除之日起10个工作日内向甲方退还剩余旅游费用；</p>
                        <p>行程中解除合同的，乙方扣除必要费用后，应当在协助甲方返回出发地或者到达甲方指定的合理地点后10个工作日内向甲方退还剩余旅游费用。</p>
                        <h3>第七条  违约责任</h3>
                        <p>（一）乙方在行程前30日以内（不含第30日，下同）提出解除合同的，向甲方退还全额旅游费用（不得扣除签证／签注等费用），并按下列标准向甲方支付违约金：_</p>
                        <p>（1）行程前30日至15日，支付旅游费用2%的违约金；</p>
                        <p>（2）行程前14日至7日，支付旅游费用5%的违约金；</p>
                        <p>（3）行程前6日至4日，支付旅游费用10%的违约金；</p>
                        <p>（4）行程前3日至1日，支付旅游费用总额15%的违约金；</p>
                        <p>（5）行程开始当日，支付旅游费用20%的违约金。</p>
                        <p>如上述违约金不足以赔偿甲方的实际损失，乙方应当按实际损失对甲方予以赔偿。</p>
                        <p>乙方应当在取消出团通知到达日起5个工作日内，向甲方退还全额旅游费用并支付违约金。</p>
                        <p>（二）甲方逾期支付旅游费用的，应当每日按照逾期支付的旅游费用的1%，向乙方支付违约金。</p>
                        <p>（三）甲方在旅游活动中或者在解决纠纷时，损害乙方及其工作人员的合法权益的，应依法承担赔偿责任。</p>
                        <p>（四）甲方提供的个人信息及相关材料不真实而造成损失，由其自行承担；如给乙方造成损失的，甲方还应当承担赔偿责任。</p>
                        <p>（五）甲方未提供与旅游活动相关的个人健康信息未履行如实告知义务，或者不听从乙方的告知、警示，参加不适合自身条件的旅游活动，导致旅游过程中出现人身损害、财产损失的，相应责任由甲方承担。甲方因不听从乙方的劝告、提示而影响团队行程，给乙方造成损失的，应当承担相应的赔偿责任。</p>
                        <p>（六）乙方未按合同约定标准提供交通、住宿、餐饮等服务，或者未经甲方同意调整旅游行程，给甲方造成损失的，责任由乙方承担。</p>
                        <p>（七）乙方未经甲方同意，擅自将旅游者转团、拼团的，甲方在行程前（不含当日）得知的，有权解除合同，乙方全额退还已交旅游费用，并按旅游费用的15%支付违约金；甲方在行程开始当日或者行程开始后得知的，乙方应当按旅游费用的25%支付违约金。如违约金不足以赔偿甲方的实际损失，乙方应当按实际损失对旅游者予以赔偿。</p>
                        <p>（八）乙方未经与甲方协商一致或者未经甲方要求，乙方指定具体购物场所或安排另行付费旅游项目的，甲方有权在旅游行程结束后三十日内，要求乙方为其办理退货并先行垫付退货货款，或者退还另行付费旅游项目的费用。</p>
                        <p>（九）乙方具备履行条件，经甲方要求仍拒绝履行合同，造成甲方人身损害、滞留等严重后果的，甲方除要求乙方承担相应的赔偿责任外，还可以要求乙方支付旅游费用一倍的赔偿金。</p>
                        <h3>第八条  其他责任</h3>
                        <p>（一）自行安排活动期间，甲方人身、财产权益受到损害的，乙方在事前已尽到必要警示说明义务且事后已尽到必要协助义务的，乙方不承担赔偿责任。</p>
                        <p>（二）由于第三方侵害等不可归责于乙方的原因导致旅游者人身、财产权益受到损害的，乙方不承担赔偿责任。但因乙方不履行协助义务致使甲方人身、财产权益损失扩大的，应当就扩大的损失承担赔偿责任。</p>
                        <p>（三）由于公共交通经营者的原因造成甲方人身损害、财产损失依法应承担责任的，乙方应当协助甲方向公共交通经营者索赔。</p>
                        <h3>第九条  争议解决方式</h3>
                        <p>本合同履行过程中发生争议，由双方协商解决，亦可在旅游合同结束之日90天内向合同签订地的旅游质监机构申请调解，亦可向消费者协会等有关部门或者机构申请调解。协商或者调解不成的，可依法向徐汇区人民法院起诉。</p>
                        <h3>第十条  合同生效</h3>
                        <p>本合同自双方签字或盖章之日起生效，本合同附有行程单、安全告知书、补充条款的均为合同附件，与本合同具有同等的法律效力。（如合同空间不够，可以附纸张贴于空白处，在连接处需双方签名盖章。）</p>
                        <p></p>
                        <table align="center" class="bctk">
                          <tr>
                            <td valign="top" >补 充 条 款</td>
                          </tr>
                        </table>
                        <p></p>
                        <p>甲方签字（盖章）：<u>《游客姓名》</u>乙方签字（盖章）：______________</p>
                        <p>住  所：__________________________营业场所：_____________________</p>
                        <p>甲方代表：__________________________乙方代表（经办人）：____________</p>
                        <p>联系电话：<u>《联系电话》</u>联系电话：_____________________</p>
                        <p>邮  编：__________________________邮  编：_____________________</p>
                        <p>日  期：<u>《合同日期》</u>日  期：<u>《合同日期》</u></p>
                    </div>
                    <!--境内旅游合同-->
                    <div class="word inland <%=hide_inland %>">
                        <h1>上海市境内旅游合同示范文本</h1>
                        <h1>（2013版）</h1>
                        <h2>使用说明</h2>
                        <p>一、根据《中华人民共和国合同法》、《中华人民共和国旅游法》、《旅行社条例》制订本合同，供旅游者参加出境旅游（不含赴台湾地区旅游）与旅行社签订团队出境旅游合同时使用。旅游者应选择具有合法经营出境旅游业务资格的旅行社。旅行社应具有旅游行政管理部门颁发的《旅行社业务经营许可证》和工商行政管理部门颁发的《营业执照》。</p>
                        <p>二、旅游前，旅行社应当与旅游者签订书面旅游合同，向旅游者提供与本合同团号一致的旅游行程单，经双方签字或者盖章确认后作为本合同的组成部分。旅游者在交纳费用后，旅行社应开具发票。</p>
                        <p>三、旅游者应结合自身身体状况选择旅游产品及项目。</p>
                        <p>四、旅行社委托组团、拼团的，须事先告知旅游者并在本合同中载明。拼团，指出境社在保证所承诺的服务内容和标准不变的前提下，在签订合同时经旅游者同意，与其他出境社招徕的旅游者拼成一个团统一安排旅游服务的行为。</p>
                        <p>五、旅游者与旅行社通过互联网在线旅游网站签订合同的可使用本合同电子版。</p>
                        <p>六、在填写本合同第二条“行程与标准”和“旅游行程单”时，旅行社应以准确、明晰的语言表述，不得出现“准X星级”、“相当于X星级”“豪华”、“仅供参考”、“与××同级”等模糊不确定性用语。</p>
                        <p></p>
                        <p>七、旅游者有权自主选择旅游产品和服务，有权拒绝旅行社的强制交易行为。</p>
                        <p>八、旅行社在签订合同时应注明该旅游项目所包含的景点门票及住宿、餐饮、交通标准、导游服务等相关内容。</p>
                        <p>九、旅行社制定补充条款对本合同示范文本有关条款的内容进行补充、细化的，补充条款的内容不得减轻或者免除应当由旅行社承担的责任。</p>
                        <p>十、本合同文本是《上海市境内旅游合同示范文本(2009版)》修改版本。</p>
                        <p>十一、旅游咨询与投诉机构：</p>
                        <p>1、上海市旅游质量监督所地址：中山西路2525号    邮编：200030</p>
                        <p>投诉电话：64393615、962020</p>
                        <p>2、上海市消费者申（投）诉举报中心</p>
                        <p>举报投诉电话：12315</p>
                        <p>3、上海市文化市场行政执法总队地址：永嘉路383号    邮编：200040</p>
                        <p>旅游违法违规举报电话：12318</p>
                        <p>合同编号：<u>《合同编号》</u></p>
                        <h2>上海市境内旅游合同</h2>
                        <h2>（2013版）</h2>
                        <p>甲方（旅游者或旅游团体）：<u>《游客姓名》</u></p>
                        <p>乙方（旅行社）：上海中国青年旅行社_经营许可证编号：<u>L-SH-CJ00004</u></p>
                        <p>经营范围：入境旅游业务，国内旅游业务，特许经营中国公民自费出国</p>
                        <p>旅游业务。国内国际航空运输销售代理、会展服务。_______________________</p>
                        <p></p>
                        <p>根据《中华人民共和国旅游法》、《中华人民共和国合同法》、《旅行社条例》及其它有关法律法规的规定，双方在平等自愿、协商一致的基础上，签订本合同。</p>
                        <h3>第一条  合同标的</h3>
                        <p>旅游产品名称《线路名称》。</p>
                        <p>团号《团号》，人数_《订单人数》_。</p>
                        <p>组团方式</p>
                        <p>□自行组团</p>
                        <p>□委托组团（委托社全称___________________________）。</p>
                        <p>□拼  团（其他社全称___________________________）。</p>
                        <p>出发日期《出发日期》，出发地点_________________________。</p>
                        <p>途径地点（经停地点）______________________________________。</p>
                        <p>目的地____________________________________________________。</p>
                        <p>结束日期《返回日期》，返回地点__________________________。</p>
                        <h3>第二条  行程与标准（提供旅游行程单，须含下列要素）</h3>
                        <p>景点名称和游览时间<u>详见行程</u></p>
                        <p>__________________________________________________________。</p>
                        <p>往返交通<u>详见行程</u>，标准<u>详见行程</u>。</p>
                        <p>游览交通<u>详见行程</u>，标准<u>详见行程</u>。</p>
                        <p>旅游者自由活动时间<u>详见行程</u>，次数<u>详见行程</u>。</p>
                        <p>住宿安排（名称）及标准和住宿天数<u>详见行程</u>。</p>
                        <p>用餐次数<u>详见行程</u>，标准<u>详见行程</u>。</p>
                        <p>地接社名称<u>详见行程</u>，地址<u>详见行程</u>，</p>
                        <p>地接社联系人<u>详见行程</u>，联系电话<u>详见行程</u>。</p>
                        <h3>第三条  旅游者保险</h3>
                        <p>乙方提示甲方购买旅游意外险。经乙方推荐，甲方_________（应填同意或不同意，打勾无效）委托乙方办理个人投保的旅游意外保险。</p>
                        <p>保险公司及产品名称：______________________________________。</p>
                        <p>保险金额：___________元，保险费__________元。</p>
                        <h3>第四条  旅游费用及其支付</h3>
                        <p>甲方应交纳旅游费用总额《费用合计》元，大写________元。（含领队、导游服务费用________元/人，合计__________元）。</p>
                        <p>旅游费用交纳期限__________________________________________。</p>
                        <p>旅游费用交纳方式_□现金；□支票；□信用卡；□其他_________。</p>
                        <h3>第五条  双方的权利义务</h3>
                        <p>（一）甲方的权利与义务</p>
                        <p>1、甲方应自觉遵守旅游文明行为规范。尊重旅游目的地的风俗习惯、文化传统和宗教禁忌，爱护旅游资源，保护生态环境；甲方在旅游活动中应遵守团队纪律，配合乙方完成合同约定的旅游行程。</p>
                        <p>2、甲方有权知悉其购买的旅游产品和服务的真实情况，自主选择旅游产品和服务，有权拒绝乙方的强制交易行为，有权要求乙方按照约定提供产品和服务，拒绝乙方未经协商一致指定具体购物场所，安排另行付费旅游项目的行为。</p>
                        <p>3、甲方有权拒绝乙方未经事先协商一致的转团、拼团行为。</p>
                        <p>4、在旅游过程中，甲方应自行保管好随身携带的财物。</p>
                        <p>5、在自行安排活动期间，甲方应在自己能够控制风险的范围内活动，选择自己能够控制风险的活动项目，并对自己的安全负责。</p>
                        <p>6、行程中发生纠纷，甲方应与乙方平等协商解决，不得损害乙方的合法权益，不得以拒绝上、下机（车、船）等方式拖延行程或脱团，否则应当就扩大的损失承担赔偿责任。</p>
                        <p>7、甲方在签订合同或者填写各种材料时，应当使用有效身份证件，并对填写信息的真实性、有效性负责。限制民事行为能力人单独出行的，须由监护人陪同出行。</p>
                        <p>8、甲方购买旅游产品、接受旅游服务时，应当如实告知与旅游活动相关的个人健康信息，参加适合自身条件的旅游活动，遵守旅游活动中的安全警示要求，配合有关部门、机构或乙方采取的安全防范和应急处理措施。</p>
                        <p>9、甲方不能成行的，可以让具备参加本次旅游条件的第三人代为履行合同，并及时通知乙方。因代为履行合同增加或减少的费用，双方应按实结算。</p>
                        <p>（二）乙方的权利与义务</p>
                        <p>1、乙方不得以不合理的低价组织旅游活动，诱骗旅游者，并通过安排购物或者另行付费旅游项目获取回扣等不正当利益。</p>
                        <p>2、乙方应在出团前，如实告知相关旅游服务项目和标准，及应当注意的旅游目的地的风俗习惯、宗教禁忌。</p>
                        <p>3、乙方在合同订立时及履行中，应如实告知甲方不适合参加旅游行程的情形，对可能危及甲方人身、财产安全的注意事项，须向甲方做出真实的说明和明确的警示（可另附安全告知书，并要求甲方签字确认）。甲方人身、财产权益受到损害时，乙方应当采取合理必要的保护和救助措施。</p>
                        <p>4、甲方属老年人等特殊群体凭有效证件可享受旅游景点门票优惠的，双方对该旅游景点门票价格可在补充条款中另行约定。</p>
                        <p>5、因航空、轮船、铁路运输等费用遇政策性调价导致合同总价发生变更的，双方应按实际差额结算，多退少补。</p>
                        <p>6、因不可抗力或者乙方、其他履行辅助人已尽合理注意义务仍不能避免的事件，影响旅游行程的，按照下列情形处理：</p>
                        <p>（1）合同不能继续履行的，可以解除合同。合同不能完全履行的，乙方经向甲方作出说明，可以在合理范围内变更合同；甲方不同意变更的，可以解除合同。</p>
                        <p>（2）合同解除的，乙方在扣除已向地接社或者履行辅助人支付且不可退还的费用后（包括但不仅限于机票、火车票、船票等交通费用和其他不可撤销的预定费用），将余款退还甲方；因合同变更而增加的费用由甲方承担，减少的费用退还甲方。</p>
                        <p>（3）危及旅游者人身、财产安全的，乙方应当采取相应的安全措施，因此支出的费用，由甲方承担。</p>
                        <p>（4）造成甲方滞留的，乙方应当采取相应的安置措施。因此增加的食宿费用，由甲方自行承担；增加的返程费用，由甲乙方平均分担。</p>
                        <p>7、因不可抗力等不可归责于乙方的客观原因或者乙方已尽合理注意义务仍不能避免的事件包括并不限于：恶劣天气、自然灾害、战争、罢工、骚乱、恐怖事件、政府行为、公共卫生事件、公共交通工具延误或（和）取消团队位置或（和）更改班次、危及旅游者人身和财产安全的意外情形等客观原因，造成旅游行程安排的交通服务延误或取消、景区临时关闭、宾馆饭店临时被征用、我国政府机构发布旅游预警信息等，因上述事由导致旅游目的无法实现，乙方不承担违约责任，但乙方应当将未发生的旅游费用退还甲方。</p>
                        <p> 8、乙方按照合同约定，为旅游团队委派的导游人员，应持有国家规定的导游证。</p>
                        <p> 9、甲方有下列情形之一的，乙方可以解除合同：</p>
                        <p>（1）患有传染病等疾病，可能危害其他旅游者健康和安全的；</p>
                        <p>（2）携带危害公共安全的物品且不同意交有关部门处理的；</p>
                        <p>（3）从事违法或者违反社会公德的活动的；</p>
                        <p>（4）从事严重影响其他旅游者权益的活动，且不听劝阻、不能制止的；</p>
                        <p>（5）法律规定的其他情形。</p>
                        <p>因前款情形解除合同的，乙方应当在扣除必要的费用后，将余款退还甲方；给乙方造成损失的，甲方应当依法承担赔偿责任。</p>
                        <p>10、成团人数与不成团的约定（二选一）</p>
                        <p>□最低成团人数______人；低于此人数不能成团时，乙方应当提前30日（按照出发日减去解除合同通知到达日的自然日之差计算，下同）通知甲方，本合同解除，向甲方退还已收取的全部费用。</p>
                        <p>□本团成团不受最低人数限制。</p>
                        <h3>第六条  甲方解除合同及承担必要费用</h3>
                        <p>因甲方自身原因导致合同解除，乙方扣除必要的费用后，将余款退还甲方。</p>
                        <p>（一）在行程前解除合同的，必要的费用扣除标准为：</p>
                        <p>1、行程前7日至4日，旅游费用30%；</p>
                        <p>2、行程前3日至1日，旅游费用50%</p>
                        <p>3、行程开始当日，旅游费用80%。</p>
                        <p>甲方行程前逾期支付旅游费用超过<span style="color:red; font-weight:bold;">2</span>日的，或者甲方未按约定时间到达约定集合出发地点，也未能在中途加入旅游团队的，乙方可以视为甲方解除合同，乙方可以按本款规定扣除必要的费用后，将余款退还甲方。</p>
                        <p>（二）在行程中解除合同的，必要的费用扣除标准为：</p>
                        <p>（旅游费用-旅游费用*行程开始当日扣除比例)/旅游天数×已经出游的天数+旅游费用*行程开始当日扣除比例。</p>
                        <p>如按上述方式支付的必要的费用低于实际发生的费用，按照实际发生的费用扣除，但最高额不应当超过旅游费用总额。乙方实际发生的费用为国内交通票损失费和已向地接社或者履行辅助人支付且不可退还的费用。</p>
                        <p>行程前解除合同的，乙方扣除必要的费用后，应当在合同解除之日起10个工作日内向甲方退还剩余旅游费用；</p>
                        <p>行程中解除合同的，乙方扣除必要的费用后，应当在协助甲方返回出发地或者到达甲方指定的合理地点后10个工作日内向甲方退还剩余旅游费用。</p>
                        <h3>第七条  违约责任</h3>
                        <p>（一）乙方在行程前7日以内（不含第7日，下同）提出解除合同的，向甲方退还全额旅游费用，并按下列标准向甲方支付违约金：</p>
                        <p>（1）行程前7日至6日，支付旅游费用5%的违约金；</p>
                        <p>（2）行程前5日至4日，支付旅游费用10%的违约金；</p>
                        <p>（3）行程前3日至1日，支付旅游费用总额15%的违约金；</p>
                        <p>（4）行程开始当日，支付旅游费用20%的违约金。</p>
                        <p>如上述违约金不足以赔偿甲方的实际损失，乙方应当按实际损失对甲方予以赔偿。</p>
                        <p>乙方应当在取消出团通知到达日起5个工作日内，向甲方退还全额旅游费用并支付违约金。</p>
                        <p>（二）甲方逾期支付旅游费用的，应当每日按照逾期支付的旅游费用的1%，向乙方支付违约金。</p>
                        <p>（三）甲方在旅游活动中或者在解决纠纷时，损害乙方及其工作人员的合法权益的，应依法承担赔偿责任。</p>
                        <p>（四）甲方提供的个人信息及相关材料不真实而造成损失，由其自行承担；如给乙方造成损失的，甲方还应当承担赔偿责任。</p>
                        <p>（五）（五）甲方未提供与旅游活动相关的个人健康信息未履行如实告知义务，或者不听从乙方的告知、警示，参加不适合自身条件的旅游活动，导致旅游过程中出现人身损害、财产损失的，相应责任由甲方承担。甲方因不听从乙方的劝告、提示而影响团队行程，给乙方造成损失的，应当承担相应的赔偿责任。</p>
                        <p>（六）乙方未按合同约定标准提供交通、住宿、餐饮等服务，或者未经甲方同意调整旅游行程，给甲方造成损失的，责任由乙方承担。</p>
                        <p>（七）乙方未经甲方同意，擅自将旅游者转团、拼团的，甲方在行程前（不含当日）得知的，有权解除合同，乙方全额退还已交旅游费用，并按旅游费用的15%支付违约金；甲方在行程开始当日或者行程开始后得知的，乙方应当按旅游费用的25%支付违约金。如违约金不足以赔偿甲方的实际损失，乙方应当按实际损失对旅游者予以赔偿。</p>
                        <p>（八）乙方未经与甲方协商一致或者未经甲方要求，指定具体购物场所或安排另行付费旅游项目的，甲方有权在旅游行程结束后三十日内，要求乙方为其办理退货并先行垫付退货货款，或者退还另行付费旅游项目的费用。</p>
                        <p>（九）乙方具备履行条件，经甲方要求仍拒绝履行合同，造成甲方人身损害、滞留等严重后果的，甲方除要求乙方承担相应的赔偿责任外，还可以要求乙方支付旅游费用一倍的赔偿金。</p>
                        <h3>第八条  其他责任</h3>
                        <p>（一）自行安排活动期间，甲方人身、财产权益受到损害的，乙方在事前已尽到必要警示说明义务且事后已尽到必要协助义务的，乙方不承担赔偿责任。</p>
                        <p>（二）由于第三方侵害等不可归责于乙方的原因导致旅游者人身、财产权益受到损害的，乙方不承担赔偿责任。但因乙方不履行协助义务致使甲方人身、财产权益损失扩大的，应当就扩大的损失承担赔偿责任。</p>
                        <p>（三）由于公共交通经营者的原因造成甲方人身损害、财产损失依法应承担责任的，乙方应当协助甲方向公共交通经营者索赔。</p>
                        <h3>第九条  争议解决方式</h3>
                        <p>本合同履行过程中发生争议，由双方协商解决，亦可在旅游合同结束之日90天内向合同签订地的旅游质监机构申请调解，亦可向消费者协会等有关部门或者机构申请调解。协商或者调解不成的，可依法向徐汇区人民法院起诉。</p>
                        <h3>第十条  合同生效</h3>
                        <p>本合同自双方签字或盖章之日起生效，本合同附有行程单、安全告知书、补充条款的均为合同附件，与本合同具有同等的法律效力。（如合同空间不够，可以附纸张贴于空白处，在连接处需双方签名盖章。）</p>
                        <p></p>
                        <table align="center" class="bctk">
                          <tr>
                            <td valign="top" >补 充 条 款</td>
                          </tr>
                        </table>
                        <p></p>
                        <p>甲方签字（盖章）：<u>《游客姓名》</u>乙方签字（盖章）：______________</p>
                        <p>住  所：__________________________营业场所：_____________________</p>
                        <p>甲方代表：__________________________乙方代表（经办人）：____________</p>
                        <p>联系电话：<u>《联系电话》</u>联系电话：_____________________</p>
                        <p>邮  编：__________________________邮  编：_____________________</p>
                        <p>日  期：<u>《合同日期》</u>日  期：<u>《合同日期》</u></p>
                    </div>
                    <!--签证注意事项-->
                    <div class="word inland <%=hide_visa %>">
                        <p>1、请务必确保您的护照在归国后仍有半年以上有效期，并且至少留有两页空白签证页；
                        以上签证价格、所需材料，若领馆临时变更，以领馆变更为准；</p>
                        <p>2、办理时长指领馆正常受理工作日（领馆节假日随各国情况有所差异）往返快递时间另计；</p>
                        <p>3、准备好材料后可以亲自前往分公司或快递材料至分公司（具体地址客服会告知），请在快递材料时注明您的订单号和办理的国家签证类型；</p>
                        <p>4、您的签证申请是否成功，完全由该国的签证官根据您递交的申请材料独立判断，本公司不得以任何方式的干预或交涉；本公司重申，在任何情况下，本公司都不承担由签证申请结果而导致被追溯任何赔偿的责任和义务；</p>
                        <p>5、有关签证资料上公布的签证有效期和停留天数，仅做参考而非任何法定承诺，一切均以签证官签发的签证内容，为唯一依据。</p>
                        <p>6、使馆保留要求申请人补资料或要求申请人前往使馆面试的权利；
                        请您待拿到签证及护照后再出机票或与酒店确认付款，避免不必要的损失；</p>
                    </div>
                </div>
            </div>
            <div class="own-expense clearfix <%=visahide %>">
                <div class="accept">
                    <input name="tyg" id="tyg" type="checkbox" datatype="*" nullmsg="请选择协议" checked /><label for="tyg">我已阅读并接受以上条款</label>
                </div>
            </div>
            <div class="confirm-box clearfix">
            	<a class="con-pre fl" href="javascript:;" onclick="javascript:history.go(-1)">< 上一步</a>
                <input id="ordersubmit" class="con-next rl" type="submit" value="同意以上条款，去付款" />
                <%--<input id="ordersubmit" class="con-next rl" type="button" onclick="Order()" value="同意以下条款，去付款" />--%>
            </div>
            </form>
		</div>
        <!--左侧 end-->
		<!--右侧-->
		<div class="side-content-book rl">
			<div class="m-bill">我的账单</div>
            <%=price01%>
            <%=price02%>
            <%=price03%>
            <dl><dt>优惠信息</dt><dd><p>优惠券立减</p><strong id="couponInfo" name="couponInfo"></strong></dd></dl>
            <dl><dt>积分信息</dt><dd><p>积分抵现</p><strong id="IntegralInfo" name="IntegralInfo"></strong></dd></dl>
            <div class="bill-all">
            	<p>合计：</p>
                <strong><em>¥</em><span id="finalPrice" name="finalPrice"><%=Price%></span>元</strong>
            </div>
            <div class="bill-con">
            	<i></i>
            	<h2>4006-777-666</h2>
                <p>如遇到问题，请咨询我们!</p>
            </div>
		</div>
	</div>
	<!--正文内容End-->
	
    <!--页尾Begin-->
	<uc2:Footer ID="Footer1" runat="server" />
    <script src="/newjs/jquery-1.7.2.min.js"></script>
	<script type="text/javascript" src="/newjs/common.js"></script>
    <script type="text/javascript" src="/newjs/datebind.js"></script>
    <script type="text/javascript" src="/newjs/Validform_v5.3.2_min.js"></script>
    <script type="text/javascript">
        $(".registerform").Validform({
            showAllError: true,
            ignoreHidden: true,
            tiptype: 3,
            datatype: {//传入自定义datatype类型【方式二】;
                "z2-5": /^[\u4E00-\u9FA5\uf900-\ufa2d]{2,5}$/,
                "n-e": /^[A-Za-z0-9]+$/
            },
            callback: function (data) {
                Order();
            }
        });
    </script>
    <script type="text/javascript">
        function Order() {
            var url = "/Login/AjaxService.aspx?action=IsLogin&r=" + Math.random();
            $.getJSON(url, function (date) {
                if (date.success == 0) {
                    OrderNow();
                }
                else {
                    LoginNow("neworder");
                }
            })
        }

        function Coupon() {
            var url = "/Login/AjaxService.aspx?action=IsLogin&r=" + Math.random();
            $.getJSON(url, function (date) {
                if (date.success == 0) {
                    checkCoupon();
                }
                else {
                    LoginNow("checkCoupon");
                }
            })
        }

        function Integral() {
            var url = "/Login/AjaxService.aspx?action=IsLogin&r=" + Math.random();
            $.getJSON(url, function (date) {
                if (date.success == 0) {
                    checkIntegral();
                }
                else {
                    LoginNow("checkIntegral");
                }
            })
        }

        function ValidCoupon() {
            var url = "/Login/AjaxService.aspx?action=IsLogin&r=" + Math.random();
            $.getJSON(url, function (date) {
                if (date.success == 0) {
                    seachVaildCoupon();
                }
                else {
                    LoginNow("checkCoupon");
                }
            })
        }

        function checkCoupon() {
            if ($(".thickbox").length != 0) {
                jdThickBoxclose()
            }
            if ($('input[name="coupon"]:checked').val() == "使用") {
                var price = $("#price").val();
                $("#useCoupon").attr('disabled', "true");
                var url = "/newpage/AjaxService.aspx?action=checkCoupon&price=" + price + "&r=" + Math.random();
                $.post(url, $("#submit_form").serialize(), function (data) {
                    var obj = eval(data);
                    if (obj.success) {
                        alert("优惠券使用成功！");
                        var finalPrice;
                        if ($("#finalPrice").text()) {
                            finalPrice = $("#finalPrice").text();
                        } else {
                            finalPrice = $("#price").val();
                        }
                        $("#couponInfo").text("¥-" + obj.success);
                        $("#couponAmount").val(obj.success);
                        $("#finalPrice").text(parseInt(finalPrice) - parseInt(obj.success));
                    }
                    else {
                        alert(obj.error);
                        $('#useCoupon').removeAttr("disabled");

                    }
                });
            }
        }
        function checkIntegral() {
            if ($(".thickbox").length != 0) {
                jdThickBoxclose()
            }
            if ($('input[name="Integral"]:checked').val() == "使用") {
                var price = $("#price").val();
                $("#useIntegral").attr('disabled', "true");
                var url = "/newpage/AjaxService.aspx?action=checkIntegral&price=" + price + "&r=" + Math.random();
                $.post(url, $("#submit_form").serialize(), function (data) {
                    var obj = eval(data);
                    if (obj.success) {
                        alert("积分使用成功！");
                        var finalPrice;
                        if ($("#finalPrice").text()) {
                            finalPrice = $("#finalPrice").text();
                        } else {
                            finalPrice = $("#price").val();
                        }
                        $("#IntegralInfo").text("¥-" + obj.success);
                        $("#IntegralAmount").val(obj.success);
                        $("#finalPrice").text(parseInt(finalPrice) - parseInt(obj.success));
                    }
                    else {
                        alert(obj.error);
                        $('#useIntegral').removeAttr("disabled");

                    }
                });
            }
        }

        function seachVaildCoupon() {
            if ($(".thickbox").length != 0) {
                jdThickBoxclose()
            }
            if ($('input[name="coupon"]:checked').val() == "使用") {
                $.jdThickBox({
                    type: "iframe",
                    title: "可用优惠券",
                    source: "/NewPage/coupon/ValidCoupon.aspx",
                    width: 860,
                    height: 480,
                    _title: "thicktitler",
                    _close: "thickcloser",
                    _con: "thickconr"
                })
            }
        }

        function LoginNow(flag) {
            $.jdThickBox({
                type: "iframe",
                title: "您还没有登录",
                source: "/login/loginnow.aspx?flag=" + flag,
                width: 540,
                height: 480,
                _title: "thicktitler",
                _close: "thickcloser",
                _con: "thickconr"
            })
        }

        function OrderNow() {
            if ($(".thickbox").length != 0) {
                jdThickBoxclose()
            }
            var flag = "1";
            //alert($("#submit_form").serialize());
            //window.open("/newpage/AjaxService.aspx?action=OrderSubmit&OrderId=1db43a8f-419f-4c6c-8e74-a47b00fe08bd");
            //return;
            if ($('input[name="coupon"]:checked').val() == "使用") {
                var price = $("#price").val();
                var url = "/newpage/AjaxService.aspx?action=checkCoupon&price=" + price + "&r=" + Math.random();
                $.post(url, $("#submit_form").serialize(), function (data) {
                    var obj = eval(data);
                    if (obj.success) {
                        var finalPrice;
                        if ($("#finalPrice").text()) {
                            finalPrice = $("#finalPrice").text();
                        } else {
                            finalPrice = $("#price").val();
                        }
                        $("#couponInfo").val(obj.success);
                        $("#couponAmount").val(obj.success);
                        $("#finalPrice").val(parseInt(finalPrice) - parseInt(obj.success));
                    }
                    else {
                        alert(obj.error);
                        $('#useCoupon').removeAttr("disabled");
                    }
                });
            } else {
                $("#couponAmount").val(0);
            }
            if ($('input[name="Integral"]:checked').val() == "使用") {
                var price = $("#price").val();
                var url = "/newpage/AjaxService.aspx?action=checkIntegral&price=" + price + "&r=" + Math.random();
                $.post(url, $("#submit_form").serialize(), function (data) {
                    var obj = eval(data);
                    if (obj.success) {
                        var finalPrice;
                        if ($("#finalPrice").text()) {
                            finalPrice = $("#finalPrice").text();
                        } else {
                            finalPrice = $("#price").val();
                        }
                        $("#IntegralInfo").text(obj.success);
                        $("#IntegralAmount").val(obj.success);
                        $("#finalPrice").val(parseInt(finalPrice) - parseInt(obj.success));
                    }
                    else {
                        alert(obj.error);
                        $('#useIntegral').removeAttr("disabled");
                    }
                });
            } else {
                $("#IntegralAmount").val(0);
            }

            setTimeout(function () {
                var submit = true;
                if ($('input[name="coupon"]:checked').val() == "使用" && $("#couponAmount").val() == 0) submit = false;
                if ($('input[name="Integral"]:checked').val() == "使用" && $("#IntegralAmount").val() == 0) submit = false;
                if (submit) {
                    $("#ordersubmit").val("订单提交中，请稍候...");
                    $("#ordersubmit").attr('disabled', "true");
                    var url = "/newpage/AjaxService.aspx?action=OrderSubmit&r=" + Math.random();
                    $.post(url, $("#submit_form").serialize(), function (data) {
                        var obj = eval(data);
                        if (obj.success) {
                            top.location = "/NewPage/pay/Pay.aspx?orderid=" + obj.success;
                        }
                        else {
                            alert(obj.error);
                            $("#ordersubmit").val("同意以下条款，去付款");
                            $('#ordersubmit').removeAttr("disabled");
                        }
                    });
                }
            }, 1000);
        }

	</script>
</body>
</html>